from llama_index.core.schema import TextNode
from typing import List


def get_mos_burger_nodes() -> List[TextNode]:

    nodes = [

        TextNode(
            text="摩斯漢堡 MOS Burger【青年大滿足】超值優惠。活動期間：2025/11/01 至 2025/12/31。指定主餐搭配點心與飲品享優惠價。內容包含：1. 主餐（任選其一）：摩斯豬排堡、蜜汁烤雞堡、摩斯鱈魚堡。2. 附餐：大份薯條 或 方塊薯餅。3. 飲品：中杯冰紅茶（可補差額升級）。適合學生與小資族群的飽足選擇。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "超值組合",
                "topic": "青年大滿足",
                "keywords": ["摩斯漢堡", "MOS", "青年大滿足", "摩斯豬排堡", "薯條", "冰紅茶", "學生優惠", "午餐", "109元"],
                "valid_start": "2025-11-01",
                "valid_end": "2025-12-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger【2025 年末限定：早餐與咖啡優惠】。活動期間：即日起 至 2025/12/31。本活動為 MOS Order APP 獨享優惠。內容包含：1. 早餐獨享優惠：每日 05:00-10:30，購買早餐套餐，飲品免費升級「摩斯咖啡(M)」。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "APP限定活動",
                "topic": "早餐與咖啡優惠",
                "keywords": ["摩斯漢堡", "MOS Order", "APP優惠", "早餐", "摩斯咖啡", "升級"],
                "valid_start": "2025-11-01",
                "valid_end": "2025-12-31"
            }
        ),
        TextNode(
            text="週二摩斯咖啡日：每週二全時段供應，「摩斯咖啡(L)」優惠價 49 元（原價 60 元）；早餐時段（05:00-10:30）「摩斯豬排堡 + 摩斯咖啡(M)」優惠價 89 元（原價 100 元）。3. 加購優惠：購買週二限定套餐，可加價 20 元購得方塊薯餅(3個)。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "APP限定活動",
                "topic": "週二咖啡日",
                "keywords": ["摩斯漢堡", "MOS Order", "APP優惠", "早餐", "摩斯咖啡", "豬排堡", "週二咖啡日"],
                "valid_start": "2025-10-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger【2025 銀行與支付回饋專區】。1. 悠遊卡/悠遊付優惠：活動期間 2025/10/01 至 2025/12/31 每週一至四，於門市或 APP 使用記名悠遊卡或悠遊付單筆消費滿 100 元，享 10% 回饋金，（每月每戶上限 50 元）。2. 使用悠遊付錢包或綁定銀行帳戶扣款，贈7%悠遊付回饋金（每月每戶上限 50 元）。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "信用卡與支付回饋",
                "keywords": ["摩斯漢堡", "悠遊卡", "悠遊付", "10%回饋","7%回饋" , "電子支付","滿額"],
                "valid_start": "2025-10-01",
                "valid_end": "2025-12-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger x JCB 信用卡【指定套餐第二套半價】。活動期間：2025/08/01 至 2026/03/31。本活動需每月搶登錄名額。參加步驟：1. 每月 1 日 15:00 至專屬網頁登錄並取得序號。2. 持序號至門市消費，並使用同卡號之實體 JCB 卡結帳。3. 享指定雙人套餐優惠價（相當於第二套半價）。指定套餐內容（以 11-12 月為例）：A餐漢堡3選2(超級大麥燒肉珍珠堡/摩斯炸蝦堡/超級大麥杏鮑菇珍珠堡)+摩斯雞塊(6個)2份+冰紅茶(L)2杯 優惠價 270 元",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "JCB指定套餐第二套半價",
                "keywords": ["摩斯漢堡", "MOS", "JCB", "第二套半價", "信用卡優惠", "超級大麥燒肉珍珠堡", "摩斯炸蝦堡", "超級大麥杏鮑菇珍珠堡"],
                "valid_start": "2025-08-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger x JCB 信用卡【指定套餐第二套半價】。活動期間：2025/08/01 至 2026/03/31。本活動需每月搶登錄名額。參加步驟：1. 每月 1 日 15:00 至專屬網頁登錄並取得序號。2. 持序號至門市消費，並使用同卡號之實體 JCB 卡結帳。3. 享指定雙人套餐優惠價（相當於第二套半價）。指定套餐內容（以 11-12 月為例）：B餐漢堡2選2(輕檸雙牛堡/和風蔬活牛肉堡)+摩斯雞塊(6個)2份+冰紅茶(L)2杯 優惠價 300 元",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "JCB指定套餐第二套半價",
                "keywords": ["摩斯漢堡", "MOS", "JCB", "第二套半價", "信用卡優惠", "輕檸雙牛堡", "和風蔬活牛肉堡"],
                "valid_start": "2025-08-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger x JCB 信用卡【指定套餐第二套半價】。活動期間：2025/08/01 至 2026/03/31。本活動需每月搶登錄名額。參加步驟：1. 每月 1 日 15:00 至專屬網頁登錄並取得序號。2. 持序號至門市消費，並使用同卡號之實體 JCB 卡結帳。3. 享指定雙人套餐優惠價（相當於第二套半價）。指定套餐內容（以 11-12 月為例）：C餐漢堡3選2(薑燒珍珠堡/摩斯鱈魚堡/蜜汁烤雞堡)+摩斯雞塊(6個)2份+方塊薯餅(3個)2份+冰紅茶(L)2杯優惠價 300 元。備註：限實體卡結帳，不適用行動支付。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "JCB指定套餐半價",
                "keywords": ["摩斯漢堡", "MOS", "JCB", "第二套半價", "信用卡優惠", "薑燒珍珠堡", "摩斯鱈魚堡", "蜜汁烤雞堡"],
                "valid_start": "2025-08-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger x JCB 信用卡【指定套餐第二套半價】。活動期間：2025/08/01 至 2026/03/31。本活動需每月搶登錄名額。參加步驟：1. 每月 1 日 15:00 至專屬網頁登錄並取得序號。2. 持序號至門市消費，並使用同卡號之實體 JCB 卡結帳。3. 享指定雙人套餐優惠價（相當於第二套半價）。指定套餐內容（以 11-12 月為例）：D餐漢堡2選2(超級大麥海洋珍珠堡/超級大麥薑燒珍珠堡)+摩斯雞塊(6個)2份+冰紅茶(L)2杯 優惠價 270 元。備註：限實體卡結帳，不適用行動支付。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "JCB指定套餐半價",
                "keywords": ["摩斯漢堡", "MOS", "JCB", "第二套半價", "信用卡優惠", "超級大麥海洋珍珠堡", "超級大麥薑燒珍珠堡"],
                "valid_start": "2025-08-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger x JCB 信用卡【指定套餐第二套半價】。活動期間：2025/08/01 至 2026/03/31。本活動需每月搶登錄名額。參加步驟：1. 每月 1 日 15:00 至專屬網頁登錄並取得序號。2. 持序號至門市消費，並使用同卡號之實體 JCB 卡結帳。3. 享指定雙人套餐優惠價（相當於第二套半價）。指定套餐內容（以 11-12 月為例）：E餐漢堡2選2(超級大麥薑燒珍珠堡/蜜汁烤雞起司堡)+摩斯雞塊(6個)2份+摩斯蒟蒻冰紅茶2杯 優惠價 300 元。備註：限實體卡結帳，不適用行動支付。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "支付優惠",
                "topic": "JCB指定套餐半價",
                "keywords": ["摩斯漢堡", "MOS", "JCB", "第二套半價", "信用卡優惠", "超級大麥薑燒珍珠堡", "蜜汁烤雞起司堡"],
                "valid_start": "2025-08-01",
                "valid_end": "2026-03-31"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger【MOS 感恩回饋】活動。活動期間：2025/11/01 至 2025/11/15，AM5:00~AM10:30。購買玉子珍珠堡+冰紅茶(L) 優惠價 79 元]。感謝消費者支持，限時回饋。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "限時活動",
                "topic": "MOS感恩回饋",
                "keywords": ["摩斯漢堡", "MOS", "感恩回饋", "折扣", "玉子珍珠堡"],
                "valid_start": "2025-11-01", 
                "valid_end": "2025-11-15"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger【MOS 感恩回饋】活動。活動期間：2025/11/16 至 2025/11/30，AM10:30後。購買超級大麥海洋珍珠堡+冰紅茶(L) 優惠價 99 元]。感謝消費者支持，限時回饋。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "限時活動",
                "topic": "MOS感恩回饋",
                "keywords": ["摩斯漢堡", "MOS", "感恩回饋", "折扣", "超級大麥海洋珍珠堡"],
                "valid_start": "2025-11-16", 
                "valid_end": "2025-11-30"
            }
        ),
        TextNode(
            text="摩斯漢堡 MOS Burger【MOS 感恩回饋】活動。活動期間：2025/11/01 至 2025/11/30，全時段供應。購買抹茶紅豆米派+冰紅茶(L) 優惠價 69 元]。感謝消費者支持，限時回饋。",
            metadata={
                "store_name": "摩斯漢堡 MOS Burger",
                "category": "限時活動",
                "topic": "MOS感恩回饋",
                "keywords": ["摩斯漢堡", "MOS", "感恩回饋", "折扣", "抹茶紅豆米派"],
                "valid_start": "2025-11-01", 
                "valid_end": "2025-11-30"
            }
        ),
    ]
    return nodes
